Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A25C.tmx
Source language: en_us
Languages: zh_cn

source: Sony PS3 catching up to Wii sales
zh_cn: 索尼PS3在日本的销量正步步紧逼Wii

source: TOKYO (Reuters) - Nintendo Co Ltd's (7974.OS: Quote, Profile, Research, Stock Buzz) Wii game console once again outsold Sony Corp's (6758.T: Quote,Profile, Research, Stock Buzz) PlayStation 3 in Japan in June, but its lead is fading, a game magazine publisher said.
zh_cn: 东京（路透社）- 任天堂公司的游戏主机Wii六月份在日本的销量再一次超过了索尼公司的PS3，但其领先优势正在逐步减弱，一家游戏杂志出版商这样说。

source: Wii outsold the rival console by 1.7-to-1, making it the No.1 game console for a seventh consecutive month, Enterbrain said, but that was well short of the 6-to-1 lead the Wii had in May.
zh_cn: Wii与其竞争对手销量的比率为1.7比1，使它连续第七个月荣登游戏主机销量榜冠军，Enterbrain（一家制作娱乐相关杂志、书籍的日本公司）说。但与五月份相比，当月Wii与PS3销量比率为6比1，其领先优势已经明显减弱。

source: The launch in June of Konami Corp's (9766.T: Quote, Profile, Research, Stock Buzz) highly anticipated "Metal Gear Solid 4" for the PS3 helped stir demand for the Sony machine, the magazine said.
zh_cn: 由于科乐美公司（Konami）在六月份发售了备受期待的PS3游戏“合金装备4”，这刺激了对索尼PS3这款主机的需求，杂志评论说。

source: Nintendo sold 235,990 units of its Wii console in the five weeks ended June 29, while sales of the PS3 came to 139,494 units, Enterbrain said.
zh_cn: 截止到6月29日的五周内，任天堂共销售了235 990台Wii主机，而同期PS3销量上升至139 494台，Enterbrain说。

source: Microsoft Corp's (MSFT.O: Quote, Profile, Research, Stock Buzz) Xbox 360 trails the pack, with sales of 10,964 units.
zh_cn: 微软公司的Xbox360主机则被远远抛在后面，在这一期间只销售了10 964台。

source: Despite its strong performance in June, the PS3 has a lot of catching up to do in total sales around the world.
zh_cn: 尽管PS3在6月份的销量有着非常抢眼的表现，但是想要追赶全世界的总销量，它还有很长的路要走。

source: Sony has sold 12.85 million units of its latest console worldwide by the end of March, or just half the Wiis sold since the rival consoles were both launched in late 2006.
zh_cn: 截止到3月底，索尼公司的这款最新游戏主机全世界的总销量为12 850 000台，而这仅仅达到其竞争对手Wii销量的一半，两款主机都于2006年末发售。

source: For handheld game players, Sony sold 274,131 of its PlayStation Portable during the five-week period, surpassing Nintendo, which sold 195,714 of its DS gear, the publisher said.
zh_cn: 在掌机方面，索尼公司的PSP在上述五周时间内售出274 131台，超过了任天堂公司DS主机195 714台的成绩，该出版商说。

source: Prior to the announcement, shares in Sony closed up 0.9 percent at 4,600 yen while Nintendo gained 0.2 percent to 60,900 yen.
zh_cn: 在该公告发布之前，索尼公司的股票上涨了0.9%，收于4600日元；任天堂公司的股票则上涨了0.2%，收于60 900日元。

source: The Nikkei average .N225 was down 0.2 percent.
zh_cn: 日经225指数则下跌了0.2%。
